Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
/* SPDX-License-Identifier: GPL-2.0+ */
/*
 * Copyright (C) 2021
 * Author(s): Jesse Taube <Mr.Bossman075@gmail.com>
 */

#ifndef _DT_BINDINGS_PINCTRL_IMXRT1060_PINFUNC_H
#define _DT_BINDINGS_PINCTRL_IMXRT1060_PINFUNC_H

#define IMX_PAD_SION	0x40000000

/*
 * The pin function ID is a tuple of
 * <mux_reg conf_reg input_reg mux_mode input_val>
 */

#define MXRT1060_IOMUXC_GPIO_EMC_00_SEMC_DATA00				0x014 0x204 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_00_FLEXPWM4_PWMA00			0x014 0x204 0x494 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_00_LPSPI2_SCK				0x014 0x204 0x500 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_00_XBAR1_XBAR_IN02			0x014 0x204 0x60C 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_00_FLEXIO1_FLEXIO00			0x014 0x204 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_00_GPIO4_IO00				0x014 0x204 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_01_SEMC_DATA01				0x018 0x208 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_01_FLEXPWM4_PWMB00			0x018 0x208 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_01_LPSPI2_PCS0				0x018 0x208 0x4FC 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_01_XBAR1_IN03				0x018 0x208 0x610 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_01_FLEXIO1_FLEXIO01			0x018 0x208 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_01_GPIO4_IO01				0x018 0x208 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_02_SEMC_DATA02				0x01C 0x20C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_02_FLEXPWM4_PWMA01			0x01C 0x20C 0x498 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_02_LPSPI2_SDO				0x01C 0x20C 0x508 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_02_XBAR1_INOUT04			0x01C 0x20C 0x614 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_02_FLEXIO1_FLEXIO02			0x01C 0x20C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_02_GPIO4_IO02				0x01C 0x20C 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_03_SEMC_DATA03				0x020 0x210 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_03_FLEXPWM4_PWMB01			0x020 0x210 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_03_LPSPI2_SDI				0x020 0x210 0x504 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_03_XBAR1_INOUT05			0x020 0x210 0x618 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_03_FLEXIO1_FLEXIO03			0x020 0x210 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_03_GPIO4_IO03				0x020 0x210 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_04_SEMC_DATA04				0x024 0x214 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_04_FLEXPWM4_PWMA02			0x024 0x214 0x49C 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_04_SAI2_TX_DATA			0x024 0x214 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_04_XBAR1_INOUT06			0x024 0x214 0x61C 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_04_FLEXIO1_FLEXIO04			0x024 0x214 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_04_GPIO4_IO04				0x024 0x214 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_05_SEMC_DATA05				0x028 0x218 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_05_FLEXPWM4_PWMB02			0x028 0x218 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_05_SAI2_TX_SYNC			0x028 0x218 0x5C4 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_05_XBAR1_INOUT07			0x028 0x218 0x620 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_05_FLEXIO1_FLEXIO05			0x028 0x218 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_05_GPIO4_IO05				0x028 0x218 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_06_SEMC_DATA06				0x02C 0x21C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_06_FLEXPWM2_PWMA00			0x02C 0x21C 0x478 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_06_SAI2_TX_BCLK			0x02C 0x21C 0x5C0 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_06_XBAR1_INOUT08			0x02C 0x21C 0x624 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_06_FLEXIO1_FLEXIO06			0x02C 0x21C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_06_GPIO4_IO06				0x02C 0x21C 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_07_SEMC_DATA07				0x030 0x220 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_07_FLEXPWM2_PWMB00			0x030 0x220 0x488 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_07_SAI2_MCLK				0x030 0x220 0x5B0 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_07_XBAR1_INOUT09			0x030 0x220 0x628 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_07_FLEXIO1_FLEXIO07			0x030 0x220 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_07_GPIO4_IO07				0x030 0x220 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_08_SEMC_DM00				0x034 0x224 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_08_FLEXPWM2_PWMA01			0x034 0x224 0x47C 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_08_SAI2_RX_DATA			0x034 0x224 0x5B8 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_08_XBAR1_INOUT17			0x034 0x224 0x62C 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_08_FLEXIO1_FLEXIO08			0x034 0x224 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_08_GPIO4_IO08				0x034 0x224 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_09_SEMC_ADDR00				0x038 0x228 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_09_FLEXPWM2_PWMB01			0x038 0x228 0x48C 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_09_SAI2_RX_SYNC			0x038 0x228 0x5BC 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_09_FLEXCAN2_TX				0x038 0x228 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_09_FLEXIO1_FLEXIO09			0x038 0x228 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_09_GPIO4_IO09				0x038 0x228 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_09_FLEXSPI2_B_SS1_B			0x038 0x228 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_10_SEMC_ADDR01				0x03C 0x22C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_10_FLEXPWM2_PWMA02			0x03C 0x22C 0x480 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_10_SAI2_RX_BCLK			0x03C 0x22C 0x5B4 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_10_FLEXCAN2_RX				0x03C 0x22C 0x450 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_10_FLEXIO1_FLEXIO10			0x03C 0x22C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_10_GPIO4_IO10				0x03C 0x22C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_10_FLEXSPI2_B_SS0_B			0x03C 0x22C 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_11_SEMC_ADDR02				0x040 0x230 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_11_FLEXPWM2_PWMB02			0x040 0x230 0x490 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_11_LPI2C4_SDA				0x040 0x230 0x4E8 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_11_USDHC2_RESET_B			0x040 0x230 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_11_FLEXIO1_FLEXIO11			0x040 0x230 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_11_GPIO4_IO11				0x040 0x230 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_11_FLEXSPI2_B_DQS			0x040 0x230 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_12_SEMC_ADDR03				0x044 0x234 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_12_XBAR1_IN24				0x044 0x234 0x640 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_12_LPI2C4_SCL				0x044 0x234 0x4E4 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_12_USDHC1_WP				0x044 0x234 0x5D8 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_12_FLEXPWM1_PWMA03			0x044 0x234 0x454 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_12_GPIO4_IO12				0x044 0x234 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_12_FLEXSPI2_B_SCLK			0x044 0x234 0x754 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_13_SEMC_ADDR04				0x048 0x238 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_13_XBAR1_IN25				0x048 0x238 0x650 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_13_LPUART3_TX				0x048 0x238 0x53C 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_13_MQS_RIGHT				0x048 0x238 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_13_FLEXPWM1_PWMB03			0x048 0x238 0x464 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_13_GPIO4_IO13				0x048 0x238 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_13_FLEXSPI2_B_DATA00			0x048 0x238 0x740 0x8 0x0

