Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
#define MXRT1060_IOMUXC_GPIO_EMC_14_SEMC_ADDR05				0x04C 0x23C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_14_XBAR1_INOUT19			0x04C 0x23C 0x654 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_14_LPUART3_RX				0x04C 0x23C 0x538 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_14_MQS_LEFT				0x04C 0x23C 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_14_LPSPI2_PCS1				0x04C 0x23C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_14_GPIO4_IO14				0x04C 0x23C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_14_FLEXSPI2_B_DATA01			0x04C 0x23C 0x744 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_15_SEMC_ADDR06				0x050 0x240 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_15_XBAR1_IN20				0x050 0x240 0x634 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_15_LPUART3_CTS_B			0x050 0x240 0x534 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_15_SPDIF_OUT				0x050 0x240 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_15_QTIMER3_TIMER0			0x050 0x240 0x57C 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_15_GPIO4_IO15				0x050 0x240 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_15_FLEXSPI2_B_DATA02			0x050 0x240 0x748 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_16_SEMC_ADDR07				0x054 0x244 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_16_XBAR1_IN21				0x054 0x244 0x658 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_16_LPUART3_RTS_B			0x054 0x244 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_16_SPDIF_IN				0x054 0x244 0x5C8 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_16_QTIMER3_TIMER1			0x054 0x244 0x580 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_16_GPIO4_IO16				0x054 0x244 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_16_FLEXSPI2_B_DATA03			0x054 0x244 0x74C 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_17_SEMC_ADDR08				0x058 0x248 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_17_FLEXPWM4_PWMA03			0x058 0x248 0x4A0 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_17_LPUART4_CTS_B			0x058 0x248 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_17_FLEXCAN1_TX				0x058 0x248 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_17_QTIMER3_TIMER2			0x058 0x248 0x584 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_17_GPIO4_IO17				0x058 0x248 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_18_SEMC_ADDR09				0x05C 0x24C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_18_FLEXPWM4_PWMB03			0x05C 0x24C 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_18_LPUART4_RTS_B			0x05C 0x24C 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_18_FLEXCAN1_RX				0x05C 0x24C 0x44C 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_18_QTIMER3_TIMER3			0x05C 0x24C 0x588 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_18_GPIO4_IO18				0x05C 0x24C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_18_SNVS_VIO_5_CTL			0x05C 0x24C 0x000 0x6 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_19_SEMC_ADDR11				0x060 0x250 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_19_FLEXPWM2_PWMA03			0x060 0x250 0x474 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_19_LPUART4_TX				0x060 0x250 0x544 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_19_ENET_RDATA01			0x060 0x250 0x438 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_19_QTIMER2_TIMER0			0x060 0x250 0x56C 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_19_GPIO4_IO19				0x060 0x250 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_19_SNVS_VIO_5				0x060 0x250 0x000 0x6 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_20_SEMC_ADDR12				0x064 0x254 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_20_FLEXPWM2_PWMB03			0x064 0x254 0x484 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_20_LPUART4_RX				0x064 0x254 0x540 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_20_ENET_RDATA00			0x064 0x254 0x434 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_20_QTIMER2_TIMER1			0x064 0x254 0x570 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_20_GPIO4_IO20				0x064 0x254 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_21_SEMC_BA0				0x068 0x258 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_21_FLEXPWM3_PWMA03			0x068 0x258 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_21_LPI2C3_SDA				0x068 0x258 0x4E0 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_21_ENET_TDATA01			0x068 0x258 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_21_QTIMER2_TIMER2			0x068 0x258 0x574 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_21_GPIO4_IO21				0x068 0x258 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_22_SEMC_BA1				0x06C 0x25C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_22_FLEXPWM3_PWMB03			0x06C 0x25C 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_22_LPI2C3_SCL				0x06C 0x25C 0x4DC 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_22_ENET_TDATA00			0x06C 0x25C 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_22_QTIMER2_TIMER3			0x06C 0x25C 0x578 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_22_GPIO4_IO22				0x06C 0x25C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_22_FLEXSPI2_A_SS1_B			0x06C 0x25C 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_23_SEMC_ADDR10				0x070 0x260 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_23_FLEXPWM1_PWMA00			0x070 0x260 0x458 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_23_LPUART5_TX				0x070 0x260 0x54C 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_23_ENET_RX_EN				0x070 0x260 0x43C 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_23_GPT1_CAPTURE2			0x070 0x260 0x75C 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_23_GPIO4_IO23				0x070 0x260 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_23_FLEXSPI2_A_DQS			0x070 0x260 0x72C 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_EMC_24_SEMC_CAS				0x074 0x264 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_24_FLEXPWM1_PWMB00			0x074 0x264 0x468 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_24_LPUART5_RX				0x074 0x264 0x548 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_24_ENET_TX_EN				0x074 0x264 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_24_GPT1_CAPTURE1			0x074 0x264 0x758 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_24_GPIO4_IO24				0x074 0x264 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_24_FLEXSPI2_A_SS0_B			0x074 0x264 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_25_SEMC_RAS				0x078 0x268 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_25_FLEXPWM1_PWMA01			0x078 0x268 0x45C 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_25_LPUART6_TX				0x078 0x268 0x554 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_25_ENET_TX_CLK				0x078 0x268 0x448 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_25_ENET_REF_CLK			0x078 0x268 0x42C 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_25_GPIO4_IO25				0x078 0x268 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_25_FLEXSPI2_A_SCLK			0x078 0x268 0x750 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_EMC_26_SEMC_CLK				0x07C 0x26C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMB01			0x07C 0x26C 0x46C 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_26_LPUART6_RX				0x07C 0x26C 0x550 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_26_ENET_RX_ER				0x07C 0x26C 0x440 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_26_FLEXIO1_FLEXIO12			0x07C 0x26C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_26_GPIO4_IO26				0x07C 0x26C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_26_FLEXSPI2_A_DATA00			0x07C 0x26C 0x730 0x8 0x1

