Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
#define MXRT1060_IOMUXC_GPIO_EMC_27_SEMC_CKE				0x080 0x270 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_27_FLEXPWM1_PWMA02			0x080 0x270 0x460 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_27_LPUART5_RTS_B			0x080 0x270 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_27_LPSPI1_SCK				0x080 0x270 0x4F0 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_27_FLEXIO1_FLEXIO13			0x080 0x270 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_27_GPIO4_IO27				0x080 0x270 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_27_FLEXSPI2_A_DATA01			0x080 0x270 0x734 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_EMC_28_SEMC_WE				0x084 0x274 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_28_FLEXPWM1_PWMB02			0x084 0x274 0x470 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_28_LPUART5_CTS_B			0x084 0x274 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_28_LPSPI1_SDO				0x084 0x274 0x4F8 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_28_FLEXIO1_FLEXIO14			0x084 0x274 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_28_GPIO4_IO28				0x084 0x274 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_28_FLEXSPI2_A_DATA02			0x084 0x274 0x738 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_EMC_29_SEMC_CS0				0x088 0x278 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_29_FLEXPWM3_PWMA00			0x088 0x278 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_29_LPUART6_RTS_B			0x088 0x278 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_29_LPSPI1_SDI				0x088 0x278 0x4F4 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_29_FLEXIO1_FLEXIO15			0x088 0x278 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_29_GPIO4_IO29				0x088 0x278 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_29_FLEXSPI2_A_DATA03			0x088 0x278 0x73C 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_EMC_30_SEMC_DATA08				0x08C 0x27C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_30_FLEXPWM3_PWMB00			0x08C 0x27C 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_30_LPUART6_CTS_B			0x08C 0x27C 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_30_LPSPI1_PCS0				0x08C 0x27C 0x4EC 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_30_CSI_DATA23				0x08C 0x27C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_30_GPIO4_IO30				0x08C 0x27C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_30_ENET2_TDATA00			0x08C 0x27C 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_31_SEMC_DATA09				0x090 0x280 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_31_FLEXPWM3_PWMA01			0x090 0x280 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_31_LPUART7_TX				0x090 0x280 0x55C 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_31_LPSPI1_PCS1				0x090 0x280 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_31_CSI_DATA22				0x090 0x280 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_31_GPIO4_IO31				0x090 0x280 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_31_ENET2_TDATA01			0x090 0x280 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_32_SEMC_DATA10				0x094 0x284 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_32_FLEXPWM3_PWMB01			0x094 0x284 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_32_LPUART7_RX				0x094 0x284 0x558 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_32_CCM_PMIC_RDY			0x094 0x284 0x3FC 0x3 0x4
#define MXRT1060_IOMUXC_GPIO_EMC_32_CSI_DATA21				0x094 0x284 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_32_GPIO3_IO18				0x094 0x284 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_32_ENET2_TX_EN				0x094 0x284 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_33_SEMC_DATA11				0x098 0x288 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_33_FLEXPWM3_PWMA02			0x098 0x288 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_33_USDHC1_RESET_B			0x098 0x288 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_33_SAI3_RX_DATA			0x098 0x288 0x778 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_33_CSI_DATA20				0x098 0x288 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_33_GPIO3_IO19				0x098 0x288 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_33_ENET2_TX_CLK			0x098 0x288 0x728 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_33_ENET2_REF_CLK2			0x098 0x288 0x70C 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_34_SEMC_DATA12				0x09C 0x28C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_34_FLEXPWM3_PWMB02			0x09C 0x28C 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_34_USDHC1_VSELECT			0x09C 0x28C 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_34_SAI3_RX_SYNC			0x09C 0x28C 0x77C 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_34_CSI_DATA19				0x09C 0x28C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_34_GPIO3_IO20				0x09C 0x28C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_34_ENET2_RX_ER				0x09C 0x28C 0x720 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_35_SEMC_DATA13				0x0A0 0x290 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_35_XBAR1_INOUT18			0x0A0 0x290 0x630 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_35_GPT1_COMPARE1			0x0A0 0x290 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_35_SAI3_RX_BCLK			0x0A0 0x290 0x774 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_35_CSI_DATA18				0x0A0 0x290 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_35_GPIO3_IO21				0x0A0 0x290 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_35_USDHC1_CD_B				0x0A0 0x290 0x5D4 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_35_ENET2_RDATA00			0x0A0 0x290 0x714 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_36_SEMC_DATA14				0x0A4 0x294 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_36_XBAR1_IN22				0x0A4 0x294 0x638 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_36_GPT1_COMPARE2			0x0A4 0x294 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_36_SAI3_TX_DATA			0x0A4 0x294 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_36_CSI_DATA17				0x0A4 0x294 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_36_GPIO3_IO22				0x0A4 0x294 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_36_USDHC1_WP				0x0A4 0x294 0x5D8 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_36_ENET2_RDATA01			0x0A4 0x294 0x718 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_36_FLEXCAN3_TX				0x0A4 0x294 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_37_SEMC_DATA15				0x0A8 0x298 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_37_XBAR1_IN23				0x0A8 0x298 0x63C 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_37_GPT1_COMPARE3			0x0A8 0x298 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_37_SAI3_MCLK				0x0A8 0x298 0x770 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_37_CSI_DATA16				0x0A8 0x298 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_37_GPIO3_IO23				0x0A8 0x298 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_37_USDHC2_WP				0x0A8 0x298 0x608 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_37_ENET2_RX_EN				0x0A8 0x298 0x71C 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_37_FLEXCAN3_RX				0x0A8 0x298 0x78C 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_38_SEMC_DM01				0x0AC 0x29C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_38_FLEXPWM1_PWMA03			0x0AC 0x29C 0x454 0x1 0x2
#define MXRT1060_IOMUXC_GPIO_EMC_38_LPUART8_TX				0x0AC 0x29C 0x564 0x2 0x2
#define MXRT1060_IOMUXC_GPIO_EMC_38_SAI3_TX_BCLK			0x0AC 0x29C 0x780 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_38_CSI_FIELD				0x0AC 0x29C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_38_GPIO3_IO24				0x0AC 0x29C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_38_USDHC2_VSELECT			0x0AC 0x29C 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_38_ENET2_MDC				0x0AC 0x29C 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_39_SEMC_DQS				0x0B0 0x2A0 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_39_FLEXPWM1_PWMB03			0x0B0 0x2A0 0x464 0x1 0x2
#define MXRT1060_IOMUXC_GPIO_EMC_39_LPUART8_RX				0x0B0 0x2A0 0x560 0x2 0x2
#define MXRT1060_IOMUXC_GPIO_EMC_39_SAI3_TX_SYNC			0x0B0 0x2A0 0x784 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_39_WDOG1_WDOG_B			0x0B0 0x2A0 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_39_GPIO3_IO25				0x0B0 0x2A0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_39_USDHC2_CD_B				0x0B0 0x2A0 0x5E0 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_39_ENET2_MDIO				0x0B0 0x2A0 0x710 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_39_SEMC_DQS4				0x0B0 0x2A0 0x788 0x9 0x1

#define MXRT1060_IOMUXC_GPIO_EMC_40_SEMC_RDY				0x0B4 0x2A4 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_40_GPT2_CAPTURE2			0x0B4 0x2A4 0x768 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_40_LPSPI1_PCS2				0x0B4 0x2A4 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_40_USB_OTG2_OC				0x0B4 0x2A4 0x5CC 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_40_ENET_MDC				0x0B4 0x2A4 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_40_GPIO3_IO26				0x0B4 0x2A4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_40_USDHC2_RESET_B			0x0B4 0x2A4 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_40_SEMC_CLK5				0x0B4 0x2A4 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_EMC_41_SEMC_CSX00				0x0B8 0x2A8 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_41_GPT2_CAPTURE1			0x0B8 0x2A8 0x764 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_41_LPSPI1_PCS3				0x0B8 0x2A8 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_41_USB_OTG2_PWR			0x0B8 0x2A8 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_41_ENET_MDIO				0x0B8 0x2A8 0x430 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_EMC_41_GPIO3_IO27				0x0B8 0x2A8 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_EMC_41_USDHC1_VSELECT			0x0B8 0x2A8 0x000 0x6 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_00_FLEXPWM2_PWMA03			0x0BC 0x2AC 0x474 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_AD_B0_00_XBAR1_INOUT14			0x0BC 0x2AC 0x644 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_00_REF_CLK_32K			0x0BC 0x2AC 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_00_USB_OTG2_ID			0x0BC 0x2AC 0x3F8 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_00_LPI2C1_SCLS			0x0BC 0x2AC 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_00_GPIO1_IO00			0x0BC 0x2AC 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_00_USDHC1_RESET_B			0x0BC 0x2AC 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_00_LPSPI3_SCK			0x0BC 0x2AC 0x510 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_01_FLEXPWM2_PWMB03			0x0C0 0x2B0 0x484 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_AD_B0_01_XBAR1_INOUT15			0x0C0 0x2B0 0x648 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_01_REF_CLK_24M			0x0C0 0x2B0 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_01_USB_OTG1_ID			0x0C0 0x2B0 0x3F4 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_01_LPI2C1_SDAS			0x0C0 0x2B0 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_01_GPIO1_IO01			0x0C0 0x2B0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_01_EWM_OUT_B				0x0C0 0x2B0 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_01_LPSPI3_SDO			0x0C0 0x2B0 0x518 0x7 0x0

