Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
#define MXRT1060_IOMUXC_GPIO_AD_B0_02_FLEXCAN2_TX			0x0C4 0x2B4 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_02_XBAR1_INOUT16			0x0C4 0x2B4 0x64C 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_02_LPUART6_TX			0x0C4 0x2B4 0x554 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_02_USB_OTG1_PWR			0x0C4 0x2B4 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_02_FLEXPWM1_PWMX00			0x0C4 0x2B4 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_02_GPIO1_IO02			0x0C4 0x2B4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_02_LPI2C1_HREQ			0x0C4 0x2B4 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_02_LPSPI3_SDI			0x0C4 0x2B4 0x514 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_03_FLEXCAN2_RX			0x0C8 0x2B8 0x450 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_03_XBAR1_INOUT17			0x0C8 0x2B8 0x62C 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_03_LPUART6_RX			0x0C8 0x2B8 0x550 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_03_USB_OTG1_OC			0x0C8 0x2B8 0x5D0 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_03_FLEXPWM1_PWMX01			0x0C8 0x2B8 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_03_GPIO1_IO03			0x0C8 0x2B8 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_03_REF_CLK_24M			0x0C8 0x2B8 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_03_LPSPI3_PCS0			0x0C8 0x2B8 0x50C 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_04_SRC_BOOT_MODE00			0x0CC 0x2BC 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_04_MQS_RIGHT				0x0CC 0x2BC 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_04_ENET_TX_DATA03			0x0CC 0x2BC 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_04_SAI2_TX_SYNC			0x0CC 0x2BC 0x5C4 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_04_CSI_DATA09			0x0CC 0x2BC 0x41C 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_04_GPIO1_IO04			0x0CC 0x2BC 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_04_PIT_TRIGGER00			0x0CC 0x2BC 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_04_LPSPI3_PCS1			0x0CC 0x2BC 0x000 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_05_SRC_BOOT_MODE01			0x0D0 0x2C0 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_05_MQS_LEFT				0x0D0 0x2C0 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_05_ENET_TX_DATA02			0x0D0 0x2C0 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_05_SAI2_TX_BCLK			0x0D0 0x2C0 0x5C0 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_05_CSI_DATA08			0x0D0 0x2C0 0x418 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_05_GPIO1_IO05			0x0D0 0x2C0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_05_XBAR1_INOUT17			0x0D0 0x2C0 0x62C 0x6 0x2
#define MXRT1060_IOMUXC_GPIO_AD_B0_05_LPSPI3_PCS2			0x0D0 0x2C0 0x000 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_06_JTAG_TMS				0x0D4 0x2C4 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_06_GPT2_COMPARE1			0x0D4 0x2C4 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_06_ENET_RX_CLK			0x0D4 0x2C4 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_06_SAI2_RX_BCLK			0x0D4 0x2C4 0x5B4 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_06_CSI_DATA07			0x0D4 0x2C4 0x414 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_06_GPIO1_IO06			0x0D4 0x2C4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_06_XBAR1_INOUT18			0x0D4 0x2C4 0x630 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_06_LPSPI3_PCS3			0x0D4 0x2C4 0x000 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_07_JTAG_TCK				0x0D8 0x2C8 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_07_GPT2_COMPARE2			0x0D8 0x2C8 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_07_ENET_TX_ER			0x0D8 0x2C8 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_07_SAI2_RX_SYNC			0x0D8 0x2C8 0x5BC 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_07_CSI_DATA06			0x0D8 0x2C8 0x410 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_07_GPIO1_IO07			0x0D8 0x2C8 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_07_XBAR1_INOUT19			0x0D8 0x2C8 0x654 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_07_ENET_1588_EVENT3_OUT		0x0D8 0x2C8 0x000 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_08_JTAG_MOD				0x0DC 0x2CC 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_08_GPT2_COMPARE3			0x0DC 0x2CC 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_08_ENET_RX_DATA03			0x0DC 0x2CC 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_08_SAI2_RX_DATA			0x0DC 0x2CC 0x5B8 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_08_CSI_DATA05			0x0DC 0x2CC 0x40C 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_08_GPIO1_IO08			0x0DC 0x2CC 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_08_XBAR1_IN20			0x0DC 0x2CC 0x634 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_08_ENET_1588_EVENT3_IN		0x0DC 0x2CC 0x000 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_09_JTAG_TDI				0x0E0 0x2D0 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_09_FLEXPWM2_PWMA03			0x0E0 0x2D0 0x474 0x1 0x3
#define MXRT1060_IOMUXC_GPIO_AD_B0_09_ENET_RX_DATA02			0x0E0 0x2D0 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_09_SAI2_TX_DATA			0x0E0 0x2D0 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_09_CSI_DATA04			0x0E0 0x2D0 0x408 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_09_GPIO1_IO09			0x0E0 0x2D0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_09_XBAR1_IN21			0x0E0 0x2D0 0x658 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_09_GPT2_CLK				0x0E0 0x2D0 0x76C 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_09_SEMC_DQS4				0x0E0 0x2D0 0x788 0x9 0x2

#define MXRT1060_IOMUXC_GPIO_AD_B0_10_JTAG_TDO				0x0E4 0x2D4 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_FLEXPWM1_PWMA03			0x0E4 0x2D4 0x454 0x1 0x3
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_ENET_CRS				0x0E4 0x2D4 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_SAI2_MCLK				0x0E4 0x2D4 0x5B0 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_CSI_DATA03			0x0E4 0x2D4 0x404 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_GPIO1_IO10			0x0E4 0x2D4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_XBAR1_IN22			0x0E4 0x2D4 0x638 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_ENET_1588_EVENT0_OUT		0x0E4 0x2D4 0x000 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_FLEXCAN3_TX			0x0E4 0x2D4 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_10_ARM_TRACE_SWO			0x0E4 0x2D4 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_11_JTAG_TRSTB			0x0E8 0x2D8 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_FLEXPWM1_PWMB03			0x0E8 0x2D8 0x464 0x1 0x3
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_ENET_COL				0x0E8 0x2D8 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_WDOG1_WDOG_B			0x0E8 0x2D8 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_CSI_DATA02			0x0E8 0x2D8 0x400 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_GPIO1_IO11			0x0E8 0x2D8 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_XBAR1_IN23			0x0E8 0x2D8 0x63C 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_ENET_1588_EVENT0_IN		0x0E8 0x2D8 0x444 0x7 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_FLEXCAN3_RX			0x0E8 0x2D8 0x78C 0x8 0x2
#define MXRT1060_IOMUXC_GPIO_AD_B0_11_SEMC_CLK6				0x0E8 0x2D8 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_12_LPI2C4_SCL			0x0EC 0x2DC 0x4E4 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_12_CCM_PMIC_READY			0x0EC 0x2DC 0x3FC 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_12_LPUART1_TX			0x0EC 0x2DC 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_12_WDOG2_WDOG_B			0x0EC 0x2DC 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_12_FLEXPWM1_PWMX02			0x0EC 0x2DC 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_12_GPIO1_IO12			0x0EC 0x2DC 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_12_ENET_1588_EVENT1_OUT		0x0EC 0x2DC 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_12_NMI_GLUE_NMI			0x0EC 0x2DC 0x568 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_13_LPI2C4_SDA			0x0F0 0x2E0 0x4E8 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_13_GPT1_CLK				0x0F0 0x2E0 0x760 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_13_LPUART1_RX			0x0F0 0x2E0 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_13_EWM_OUT_B				0x0F0 0x2E0 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_13_FLEXPWM1_PWMX03			0x0F0 0x2E0 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_13_GPIO1_IO13			0x0F0 0x2E0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_13_ENET_1588_EVENT1_IN		0x0F0 0x2E0 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_13_REF_CLK_24M			0x0F0 0x2E0 0x000 0x7 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B0_14_USB_OTG2_OC			0x0F4 0x2E4 0x5CC 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_14_XBAR1_IN24			0x0F4 0x2E4 0x640 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B0_14_LPUART1_CTS_B			0x0F4 0x2E4 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_14_ENET_1588_EVENT0_OUT		0x0F4 0x2E4 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_14_CSI_VSYNC				0x0F4 0x2E4 0x428 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_14_GPIO1_IO14			0x0F4 0x2E4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_14_FLEXCAN2_TX			0x0F4 0x2E4 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B0_14_FLEXCAN3_TX			0x0F4 0x2E4 0x000 0x8 0x0

