Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_FLEXSPIA_DQS			0x120 0x310 0x4A4 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_FLEXPWM4_PWMA01			0x120 0x310 0x498 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_FLEXCAN1_RX			0x120 0x310 0x44C 0x2 0x2
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_SAI1_MCLK				0x120 0x310 0x58C 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_CSI_DATA08			0x120 0x310 0x418 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_GPIO1_IO25			0x120 0x310 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_USDHC2_CLK			0x120 0x310 0x5DC 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_KPP_COL03				0x120 0x310 0x000 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_09_FLEXIO3_FLEXIO09			0x120 0x310 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B1_10_FLEXSPIA_DATA03			0x124 0x314 0x4B4 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_WDOG1_B				0x124 0x314 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_LPUART8_TX			0x124 0x314 0x564 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_SAI1_RX_SYNC			0x124 0x314 0x5A4 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_CSI_DATA07			0x124 0x314 0x414 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_GPIO1_IO26			0x124 0x314 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_USDHC2_WP				0x124 0x314 0x608 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_KPP_ROW02				0x124 0x314 0x000 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_ENET2_1588_EVENT1_OUT		0x124 0x314 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_10_FLEXIO3_FLEXIO10			0x124 0x314 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B1_11_FLEXSPIA_DATA02			0x128 0x318 0x4B0 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_EWM_OUT_B				0x128 0x318 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_LPUART8_RX			0x128 0x318 0x560 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_SAI1_RX_BCLK			0x128 0x318 0x590 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_CSI_DATA06			0x128 0x318 0x410 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_GPIO1_IO27			0x128 0x318 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_USDHC2_RESET_B			0x128 0x318 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_KPP_COL02				0x128 0x318 0x000 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_ENET2_1588_EVENT1_IN		0x128 0x318 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_11_FLEXIO3_FLEXIO11			0x128 0x318 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B1_12_FLEXSPIA_DATA01			0x12C 0x31C 0x4AC 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_ACMP_OUT00			0x12C 0x31C 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_LPSPI3_PCS0			0x12C 0x31C 0x50C 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_SAI1_RX_DATA00			0x12C 0x31C 0x594 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_CSI_DATA05			0x12C 0x31C 0x40C 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_GPIO1_IO28			0x12C 0x31C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_USDHC2_DATA4			0x12C 0x31C 0x5F8 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_KPP_ROW01				0x12C 0x31C 0x000 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_ENET2_1588_EVENT2_OUT		0x12C 0x31C 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_12_FLEXIO3_FLEXIO12			0x12C 0x31C 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B1_13_FLEXSPIA_DATA00			0x130 0x320 0x4A8 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_ACMP_OUT01			0x130 0x320 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_LPSPI3_SDI			0x130 0x320 0x514 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_SAI1_TX_DATA00			0x130 0x320 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_CSI_DATA04			0x130 0x320 0x408 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_GPIO1_IO29			0x130 0x320 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_USDHC2_DATA5			0x130 0x320 0x5FC 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_KPP_COL01				0x130 0x320 0x000 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_ENET2_1588_EVENT2_IN		0x130 0x320 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_13_FLEXIO3_FLEXIO13			0x130 0x320 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B1_14_FLEXSPIA_SCLK			0x134 0x324 0x4C8 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_ACMP_OUT02			0x134 0x324 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_LPSPI3_SDO			0x134 0x324 0x518 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_SAI1_TX_BCLK			0x134 0x324 0x5A8 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_CSI_DATA03			0x134 0x324 0x404 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_GPIO1_IO30			0x134 0x324 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_USDHC2_DATA6			0x134 0x324 0x600 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_KPP_ROW00				0x134 0x324 0x000 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_ENET2_1588_EVENT3_OUT		0x134 0x324 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_14_FLEXIO3_FLEXIO14			0x134 0x324 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_AD_B1_15_FLEXSPIA_SS0_B			0x138 0x328 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_ACMP_OUT03			0x138 0x328 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_LPSPI3_SCK			0x138 0x328 0x510 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_SAI1_TX_SYNC			0x138 0x328 0x5AC 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_CSI_DATA02			0x138 0x328 0x400 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_GPIO1_IO31			0x138 0x328 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_USDHC2_DATA7			0x138 0x328 0x604 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_KPP_COL00				0x138 0x328 0x000 0x7 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_ENET2_1588_EVENT3_IN		0x138 0x328 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_AD_B1_15_FLEXIO3_FLEXIO15			0x138 0x328 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B0_00_LCD_CLK				0x13C 0x32C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_00_QTIMER1_TIMER0			0x13C 0x32C 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_00_MQS_RIGHT				0x13C 0x32C 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B0_00_LPSPI4_PCS0				0x13C 0x32C 0x51C 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B0_00_FLEXIO2_FLEXIO00			0x13C 0x32C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_00_GPIO2_IO00				0x13C 0x32C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_00_SEMC_CSX01				0x13C 0x32C 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_00_ENET2_MDC				0x13C 0x32C 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_01_LCD_ENABLE				0x140 0x330 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_01_QTIMER1_TIMER1			0x140 0x330 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_01_MQS_LEFT				0x140 0x330 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B0_01_LPSPI4_SDI				0x140 0x330 0x524 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B0_01_FLEXIO2_FLEXIO01			0x140 0x330 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_01_GPIO2_IO01				0x140 0x330 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_01_SEMC_CSX02				0x140 0x330 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_01_ENET2_MDIO				0x140 0x330 0x710 0x8 0x1

