Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
#define MXRT1060_IOMUXC_GPIO_B0_02_LCD_HSYNC				0x144 0x334 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_02_QTIMER1_TIMER2			0x144 0x334 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_02_FLEXCAN1_TX				0x144 0x334 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B0_02_LPSPI4_SDO				0x144 0x334 0x528 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B0_02_FLEXIO2_FLEXIO02			0x144 0x334 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_02_GPIO2_IO02				0x144 0x334 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_02_SEMC_CSX03				0x144 0x334 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_02_ENET2_1588_EVENT0_OUT		0x144 0x334 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_03_LCD_VSYNC				0x148 0x338 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_03_QTIMER2_TIMER0			0x148 0x338 0x56C 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B0_03_FLEXCAN1_RX				0x148 0x338 0x44C 0x2 0x3
#define MXRT1060_IOMUXC_GPIO_B0_03_LPSPI4_SCK				0x148 0x338 0x520 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B0_03_FLEXIO2_FLEXIO03			0x148 0x338 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_03_GPIO2_IO03				0x148 0x338 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_03_WDOG2_RESET_B_DEB			0x148 0x338 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_03_ENET2_1588_EVENT0_IN			0x148 0x338 0x724 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_B0_04_LCD_DATA00				0x14C 0x33C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_04_QTIMER2_TIMER1			0x14C 0x33C 0x570 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B0_04_LPI2C2_SCL				0x14C 0x33C 0x4D4 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B0_04_ARM_TRACE0				0x14C 0x33C 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B0_04_FLEXIO2_FLEXIO04			0x14C 0x33C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_04_GPIO2_IO04				0x14C 0x33C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_04_SRC_BOOT_CFG00			0x14C 0x33C 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_04_ENET2_TDATA03			0x14C 0x33C 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_05_LCD_DATA01				0x150 0x340 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_05_QTIMER2_TIMER2			0x150 0x340 0x574 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B0_05_LPI2C2_SDA				0x150 0x340 0x4D8 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B0_05_ARM_TRACE1				0x150 0x340 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B0_05_FLEXIO2_FLEXIO05			0x150 0x340 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_05_GPIO2_IO05				0x150 0x340 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_05_SRC_BOOT_CFG01			0x150 0x340 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_05_ENET2_TDATA02			0x150 0x340 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_06_LCD_DATA02				0x154 0x344 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_06_QTIMER3_TIMER0			0x154 0x344 0x57C 0x1 0x2
#define MXRT1060_IOMUXC_GPIO_B0_06_FLEXPWM2_PWMA00			0x154 0x344 0x478 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B0_06_ARM_TRACE2				0x154 0x344 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B0_06_FLEXIO2_FLEXIO06			0x154 0x344 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_06_GPIO2_IO06				0x154 0x344 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_06_SRC_BOOT_CFG02			0x154 0x344 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_06_ENET2_RX_CLK				0x154 0x344 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_07_LCD_DATA03				0x158 0x348 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_07_QTIMER3_TIMER1			0x158 0x348 0x580 0x1 0x2
#define MXRT1060_IOMUXC_GPIO_B0_07_FLEXPWM2_PWMB00			0x158 0x348 0x488 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B0_07_ARM_TRACE3				0x158 0x348 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B0_07_FLEXIO2_FLEXIO07			0x158 0x348 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_07_GPIO2_IO07				0x158 0x348 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_07_SRC_BOOT_CFG03			0x158 0x348 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_07_ENET2_TX_ER				0x158 0x348 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_08_LCD_DATA04				0x15C 0x34C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_08_QTIMER3_TIMER2			0x15C 0x34C 0x584 0x1 0x2
#define MXRT1060_IOMUXC_GPIO_B0_08_FLEXPWM2_PWMA01			0x15C 0x34C 0x47C 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B0_08_LPUART3_TX				0x15C 0x34C 0x53C 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B0_08_FLEXIO2_FLEXIO08			0x15C 0x34C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_08_GPIO2_IO08				0x15C 0x34C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_08_SRC_BOOT_CFG04			0x15C 0x34C 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_08_ENET2_RDATA03			0x15C 0x34C 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_09_LCD_DATA05				0x160 0x350 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_09_QTIMER4_TIMER0			0x160 0x350 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_09_FLEXPWM2_PWMB01			0x160 0x350 0x48C 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B0_09_LPUART3_RX				0x160 0x350 0x538 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B0_09_FLEXIO2_FLEXIO09			0x160 0x350 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_09_GPIO2_IO09				0x160 0x350 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_09_SRC_BOOT_CFG05			0x160 0x350 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_09_ENET2_RDATA02			0x160 0x350 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_10_LCD_DATA06				0x164 0x354 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_10_QTIMER4_TIMER1			0x164 0x354 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_10_FLEXPWM2_PWMA02			0x164 0x354 0x480 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B0_10_SAI1_TX_DATA03			0x164 0x354 0x598 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B0_10_FLEXIO2_FLEXIO10			0x164 0x354 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_10_GPIO2_IO10				0x164 0x354 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_10_SRC_BOOT_CFG06			0x164 0x354 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_10_ENET2_CRS				0x164 0x354 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_11_LCD_DATA07				0x168 0x358 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_11_QTIMER4_TIMER2			0x168 0x358 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_11_FLEXPWM2_PWMB02			0x168 0x358 0x490 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B0_11_SAI1_TX_DATA02			0x168 0x358 0x59C 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B0_11_FLEXIO2_FLEXIO11			0x168 0x358 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_11_GPIO2_IO11				0x168 0x358 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_11_SRC_BOOT_CFG07			0x168 0x358 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_11_ENET2_COL				0x168 0x358 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_12_LCD_DATA08				0x16C 0x35C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_12_XBAR1_INOUT10			0x16C 0x35C 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_12_ARM_TRACE_CLK			0x16C 0x35C 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B0_12_SAI1_TX_DATA01			0x16C 0x35C 0x5A0 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B0_12_FLEXIO2_FLEXIO12			0x16C 0x35C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_12_GPIO2_IO12				0x16C 0x35C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_12_SRC_BOOT_CFG08			0x16C 0x35C 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_12_ENET2_TDATA00			0x16C 0x35C 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_13_LCD_DATA09				0x170 0x360 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_13_XBAR1_INOUT11			0x170 0x360 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_13_ARM_TRACE_SWO			0x170 0x360 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B0_13_SAI1_MCLK				0x170 0x360 0x58C 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B0_13_FLEXIO2_FLEXIO13			0x170 0x360 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_13_GPIO2_IO13				0x170 0x360 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_13_SRC_BOOT_CFG09			0x170 0x360 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_13_ENET2_TDATA01			0x170 0x360 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_14_LCD_DATA10				0x174 0x364 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_14_XBAR1_INOUT12			0x174 0x364 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_14_ARM_TXEV				0x174 0x364 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B0_14_SAI1_RX_SYNC				0x174 0x364 0x5A4 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B0_14_FLEXIO2_FLEXIO14			0x174 0x364 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_14_GPIO2_IO14				0x174 0x364 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_14_SRC_BOOT_CFG10			0x174 0x364 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_14_ENET2_TX_EN				0x174 0x364 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_B0_15_LCD_DATA11				0x178 0x368 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B0_15_XBAR1_INOUT13			0x178 0x368 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B0_15_ARM_RXEV				0x178 0x368 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B0_15_SAI1_RX_BCLK				0x178 0x368 0x590 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B0_15_FLEXIO2_FLEXIO15			0x178 0x368 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B0_15_GPIO2_IO15				0x178 0x368 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B0_15_SRC_BOOT_CFG11			0x178 0x368 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B0_15_ENET2_TX_CLK				0x178 0x368 0x728 0x8 0x2
#define MXRT1060_IOMUXC_GPIO_B0_15_ENET2_REF_CLK2			0x178 0x368 0x70C 0x9 0x2

#define MXRT1060_IOMUXC_GPIO_B1_00_LCD_DATA12				0x17C 0x36C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_00_XBAR1_INOUT14			0x17C 0x36C 0x644 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_00_LPUART4_TX				0x17C 0x36C 0x544 0x2 0x2
#define MXRT1060_IOMUXC_GPIO_B1_00_SAI1_RX_DATA00			0x17C 0x36C 0x594 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B1_00_FLEXIO2_FLEXIO16			0x17C 0x36C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_00_GPIO2_IO16				0x17C 0x36C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_00_FLEXPWM1_PWMA03			0x17C 0x36C 0x454 0x6 0x4
#define MXRT1060_IOMUXC_GPIO_B1_00_ENET2_RX_ER				0x17C 0x36C 0x720 0x8 0x2
#define MXRT1060_IOMUXC_GPIO_B1_00_FLEXIO3_FLEXIO16			0x17C 0x36C 0x000 0x9 0x0

