Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
#define MXRT1060_IOMUXC_GPIO_B1_01_LCD_DATA13				0x180 0x370 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_01_XBAR1_INOUT15			0x180 0x370 0x648 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_01_LPUART4_RX				0x180 0x370 0x540 0x2 0x2
#define MXRT1060_IOMUXC_GPIO_B1_01_SAI1_TX_DATA00			0x180 0x370 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B1_01_FLEXIO2_FLEXIO17			0x180 0x370 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_01_GPIO2_IO17				0x180 0x370 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_01_FLEXPWM1_PWMB03			0x180 0x370 0x464 0x6 0x4
#define MXRT1060_IOMUXC_GPIO_B1_01_ENET2_RDATA00			0x180 0x370 0x714 0x8 0x2
#define MXRT1060_IOMUXC_GPIO_B1_01_FLEXIO3_FLEXIO17			0x180 0x370 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_02_LCD_DATA14				0x184 0x374 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_02_XBAR1_INOUT16			0x184 0x374 0x64C 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_02_LPSPI4_PCS2				0x184 0x374 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_02_SAI1_TX_BCLK				0x184 0x374 0x5A8 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B1_02_FLEXIO2_FLEXIO18			0x184 0x374 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_02_GPIO2_IO18				0x184 0x374 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_02_FLEXPWM2_PWMA03			0x184 0x374 0x474 0x6 0x4
#define MXRT1060_IOMUXC_GPIO_B1_02_ENET2_RDATA01			0x184 0x374 0x718 0x8 0x2
#define MXRT1060_IOMUXC_GPIO_B1_02_FLEXIO3_FLEXIO18			0x184 0x374 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_03_LCD_DATA15				0x188 0x378 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_03_XBAR1_INOUT17			0x188 0x378 0x62C 0x1 0x3
#define MXRT1060_IOMUXC_GPIO_B1_03_LPSPI4_PCS1				0x188 0x378 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_03_SAI1_TX_SYNC				0x188 0x378 0x5AC 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B1_03_FLEXIO2_FLEXIO19			0x188 0x378 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_03_GPIO2_IO19				0x188 0x378 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_03_FLEXPWM2_PWMB03			0x188 0x378 0x484 0x6 0x3
#define MXRT1060_IOMUXC_GPIO_B1_03_ENET2_RX_EN				0x188 0x378 0x71C 0x8 0x2
#define MXRT1060_IOMUXC_GPIO_B1_03_FLEXIO3_FLEXIO19			0x188 0x378 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_04_LCD_DATA16				0x18C 0x37C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_04_LPSPI4_PCS0				0x18C 0x37C 0x51C 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_04_CSI_DATA15				0x18C 0x37C 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_04_ENET_RX_DATA00			0x18C 0x37C 0x434 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B1_04_FLEXIO2_FLEXIO20			0x18C 0x37C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_04_GPIO2_IO20				0x18C 0x37C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_04_GPT1_CLK				0x18C 0x37C 0x760 0x8 0x1
#define MXRT1060_IOMUXC_GPIO_B1_04_FLEXIO3_FLEXIO20			0x18C 0x37C 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_05_LCD_DATA17				0x190 0x380 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_05_LPSPI4_SDI				0x190 0x380 0x524 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_05_CSI_DATA14				0x190 0x380 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_05_ENET_RX_DATA01			0x190 0x380 0x438 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B1_05_FLEXIO2_FLEXIO21			0x190 0x380 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_05_GPIO2_IO21				0x190 0x380 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_05_GPT1_CAPTURE1			0x190 0x380 0x758 0x8 0x1
#define MXRT1060_IOMUXC_GPIO_B1_05_FLEXIO3_FLEXIO21			0x190 0x380 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_06_LCD_DATA18				0x194 0x384 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_06_LPSPI4_SDO				0x194 0x384 0x528 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_06_CSI_DATA13				0x194 0x384 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_06_ENET_RX_EN				0x194 0x384 0x43C 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B1_06_FLEXIO2_FLEXIO22			0x194 0x384 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_06_GPIO2_IO22				0x194 0x384 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_06_GPT1_CAPTURE2			0x194 0x384 0x75C 0x8 0x1
#define MXRT1060_IOMUXC_GPIO_B1_06_FLEXIO3_FLEXIO22			0x194 0x384 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_07_LCD_DATA19				0x198 0x388 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_07_LPSPI4_SCK				0x198 0x388 0x520 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_07_CSI_DATA12				0x198 0x388 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_07_ENET_TX_DATA00			0x198 0x388 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B1_07_FLEXIO2_FLEXIO23			0x198 0x388 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_07_GPIO2_IO23				0x198 0x388 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_07_GPT1_COMPARE1			0x198 0x388 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_B1_07_FLEXIO3_FLEXIO23			0x198 0x388 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_08_LCD_DATA20				0x19C 0x38C 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_08_QTIMER1_TIMER3			0x19C 0x38C 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B1_08_CSI_DATA11				0x19C 0x38C 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_08_ENET_TX_DATA01			0x19C 0x38C 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B1_08_FLEXIO2_FLEXIO24			0x19C 0x38C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_08_GPIO2_IO24				0x19C 0x38C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_08_FLEXCAN2_TX				0x19C 0x38C 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B1_08_GPT1_COMPARE2			0x19C 0x38C 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_B1_08_FLEXIO3_FLEXIO24			0x19C 0x38C 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_09_LCD_DATA21				0x1A0 0x390 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_09_QTIMER2_TIMER3			0x1A0 0x390 0x578 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_09_CSI_DATA10				0x1A0 0x390 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_09_ENET_TX_EN				0x1A0 0x390 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B1_09_FLEXIO2_FLEXIO25			0x1A0 0x390 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_09_GPIO2_IO25				0x1A0 0x390 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_09_FLEXCAN2_RX				0x1A0 0x390 0x450 0x6 0x3
#define MXRT1060_IOMUXC_GPIO_B1_09_GPT1_COMPARE3			0x1A0 0x390 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_B1_09_FLEXIO3_FLEXIO25			0x1A0 0x390 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_10_LCD_DATA22				0x1A4 0x394 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_10_QTIMER3_TIMER3			0x1A4 0x394 0x588 0x1 0x2
#define MXRT1060_IOMUXC_GPIO_B1_10_CSI_DATA00				0x1A4 0x394 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_10_ENET_TX_CLK				0x1A4 0x394 0x448 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B1_10_FLEXIO2_FLEXIO26			0x1A4 0x394 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_10_GPIO2_IO26				0x1A4 0x394 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_10_ENET_REF_CLK				0x1A4 0x394 0x42C 0x6 0x1
#define MXRT1060_IOMUXC_GPIO_B1_10_FLEXIO3_FLEXIO26			0x1A4 0x394 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_11_LCD_DATA23				0x1A8 0x398 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_11_QTIMER4_TIMER3			0x1A8 0x398 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_B1_11_CSI_DATA01				0x1A8 0x398 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_11_ENET_RX_ER				0x1A8 0x398 0x440 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B1_11_FLEXIO2_FLEXIO27			0x1A8 0x398 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_11_GPIO2_IO27				0x1A8 0x398 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_11_LPSPI4_PCS3				0x1A8 0x398 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B1_11_FLEXIO3_FLEXIO27			0x1A8 0x398 0x000 0x9 0x0

