Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
#define MXRT1060_IOMUXC_GPIO_B1_12_LPUART5_TX				0x1AC 0x39C 0x54C 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_12_CSI_PIXCLK				0x1AC 0x39C 0x424 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_B1_12_ENET_1588_EVENT0_IN			0x1AC 0x39C 0x444 0x3 0x2
#define MXRT1060_IOMUXC_GPIO_B1_12_FLEXIO2_FLEXIO28			0x1AC 0x39C 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_12_GPIO2_IO28				0x1AC 0x39C 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_12_USDHC1_CD_B				0x1AC 0x39C 0x5D4 0x6 0x2
#define MXRT1060_IOMUXC_GPIO_B1_12_FLEXIO3_FLEXIO28			0x1AC 0x39C 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_13_WDOG1_B				0x1B0 0x3A0 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_13_LPUART5_RX				0x1B0 0x3A0 0x548 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_13_CSI_VSYNC				0x1B0 0x3A0 0x428 0x2 0x2
#define MXRT1060_IOMUXC_GPIO_B1_13_ENET_1588_EVENT0_OUT			0x1B0 0x3A0 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_B1_13_FLEXIO2_FLEXIO29			0x1B0 0x3A0 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_13_GPIO2_IO29				0x1B0 0x3A0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_13_USDHC1_WP				0x1B0 0x3A0 0x5D8 0x6 0x3
#define MXRT1060_IOMUXC_GPIO_B1_13_SEMC_DQS4				0x1B0 0x3A0 0x788 0x8 0x3
#define MXRT1060_IOMUXC_GPIO_B1_13_FLEXIO3_FLEXIO29			0x1B0 0x3A0 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_14_ENET_MDC				0x1B4 0x3A4 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_B1_14_FLEXPWM4_PWMA02			0x1B4 0x3A4 0x49C 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_14_CSI_HSYNC				0x1B4 0x3A4 0x420 0x2 0x2
#define MXRT1060_IOMUXC_GPIO_B1_14_XBAR1_IN02				0x1B4 0x3A4 0x60C 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B1_14_FLEXIO2_FLEXIO30			0x1B4 0x3A4 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_14_GPIO2_IO30				0x1B4 0x3A4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_14_USDHC1_VSELECT			0x1B4 0x3A4 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B1_14_ENET2_TDATA00			0x1B4 0x3A4 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_B1_14_FLEXIO3_FLEXIO30			0x1B4 0x3A4 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_B1_15_ENET_MDIO				0x1B8 0x3A8 0x430 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_B1_15_FLEXPWM4_PWMA03			0x1B8 0x3A8 0x4A0 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_B1_15_CSI_MCLK				0x1B8 0x3A8 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_B1_15_XBAR1_IN03				0x1B8 0x3A8 0x610 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_B1_15_FLEXIO2_FLEXIO31			0x1B8 0x3A8 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_B1_15_GPIO2_IO31				0x1B8 0x3A8 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_B1_15_USDHC1_RESET_B			0x1B8 0x3A8 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_B1_15_ENET2_TDATA01			0x1B8 0x3A8 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_B1_15_FLEXIO3_FLEXIO31			0x1B8 0x3A8 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B0_00_USDHC1_CMD			0x1BC 0x3AC 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_00_FLEXPWM1_PWMA00			0x1BC 0x3AC 0x458 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_00_LPI2C3_SCL			0x1BC 0x3AC 0x4DC 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_00_XBAR1_INOUT04			0x1BC 0x3AC 0x614 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_00_LPSPI1_SCK			0x1BC 0x3AC 0x4F0 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_00_GPIO3_IO12			0x1BC 0x3AC 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_00_FLEXSPIA_SS1_B			0x1BC 0x3AC 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_00_ENET2_TX_EN			0x1BC 0x3AC 0x000 0x8 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_00_SEMC_DQS4				0x1BC 0x3AC 0x788 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B0_01_USDHC1_CLK			0x1C0 0x3B0 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_01_FLEXPWM1_PWMB00			0x1C0 0x3B0 0x468 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_01_LPI2C3_SDA			0x1C0 0x3B0 0x4E0 0x2 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_01_XBAR1_INOUT05			0x1C0 0x3B0 0x618 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_01_LPSPI1_PCS0			0x1C0 0x3B0 0x4EC 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_01_GPIO3_IO13			0x1C0 0x3B0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_01_FLEXSPIB_SS1_B			0x1C0 0x3B0 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_01_ENET2_TX_CLK			0x1C0 0x3B0 0x728 0x8 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_01_ENET2_REF_CLK2			0x1C0 0x3B0 0x70C 0x9 0x1

#define MXRT1060_IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0			0x1C4 0x3B4 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_02_FLEXPWM1_PWMA01			0x1C4 0x3B4 0x45C 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_02_LPUART8_CTS_B			0x1C4 0x3B4 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_02_XBAR1_INOUT06			0x1C4 0x3B4 0x61C 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_02_LPSPI1_SDO			0x1C4 0x3B4 0x4F8 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_02_GPIO3_IO14			0x1C4 0x3B4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_02_ENET2_RX_ER			0x1C4 0x3B4 0x720 0x8 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_02_SEMC_CLK5				0x1C4 0x3B4 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1			0x1C8 0x3B8 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_03_FLEXPWM1_PWMB01			0x1C8 0x3B8 0x46C 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_03_LPUART8_RTS_B			0x1C8 0x3B8 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_03_XBAR1_INOUT07			0x1C8 0x3B8 0x620 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_03_LPSPI1_SDI			0x1C8 0x3B8 0x4F4 0x4 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_03_GPIO3_IO15			0x1C8 0x3B8 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_03_ENET2_RDATA00			0x1C8 0x3B8 0x714 0x8 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_03_SEMC_CLK6				0x1C8 0x3B8 0x000 0x9 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B0_04_USDHC1_DATA2			0x1CC 0x3BC 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_04_FLEXPWM1_PWMA02			0x1CC 0x3BC 0x460 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_04_LPUART8_TX			0x1CC 0x3BC 0x564 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_04_XBAR1_INOUT08			0x1CC 0x3BC 0x624 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_04_FLEXSPIB_SS0_B			0x1CC 0x3BC 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_04_GPIO3_IO16			0x1CC 0x3BC 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_04_CCM_CLKO1				0x1CC 0x3BC 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_04_ENET2_RDATA01			0x1CC 0x3BC 0x718 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_SD_B0_05_USDHC1_DATA3			0x1D0 0x3C0 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_05_FLEXPWM1_PWMB02			0x1D0 0x3C0 0x470 0x1 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_05_LPUART8_RX			0x1D0 0x3C0 0x560 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_05_XBAR1_INOUT09			0x1D0 0x3C0 0x628 0x3 0x1
#define MXRT1060_IOMUXC_GPIO_SD_B0_05_FLEXSPIB_DQS			0x1D0 0x3C0 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_05_GPIO3_IO17			0x1D0 0x3C0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_05_CCM_CLKO2				0x1D0 0x3C0 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B0_05_ENET2_RX_EN			0x1D0 0x3C0 0x71C 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_SD_B1_00_USDHC2_DATA3			0x1D4 0x3C4 0x5F4 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_00_FLEXSPIB_DATA03			0x1D4 0x3C4 0x4C4 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_00_FLEXPWM1_PWMA03			0x1D4 0x3C4 0x454 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_00_SAI1_TX_DATA03			0x1D4 0x3C4 0x598 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_00_LPUART4_TX			0x1D4 0x3C4 0x544 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_00_GPIO3_IO00			0x1D4 0x3C4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_00_SAI3_RX_DATA			0x1D4 0x3C4 0x778 0x8 0x1

