Mr-Bossman/u-boot/include/dt-bindings/pinctrl/pins-imxrt1060.h
#define MXRT1060_IOMUXC_GPIO_SD_B1_01_USDHC2_DATA2			0x1D8 0x3C8 0x5F0 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_01_FLEXSPIB_DATA02			0x1D8 0x3C8 0x4C0 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_01_FLEXPWM1_PWMB03			0x1D8 0x3C8 0x464 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_01_SAI1_TX_DATA02			0x1D8 0x3C8 0x59C 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_01_LPUART4_RX			0x1D8 0x3C8 0x540 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_01_GPIO3_IO01			0x1D8 0x3C8 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_01_SAI3_TX_DATA			0x1D8 0x3C8 0x000 0x8 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B1_02_USDHC2_DATA1			0x1DC 0x3CC 0x5EC 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_02_FLEXSPIB_DATA01			0x1DC 0x3CC 0x4BC 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_02_FLEXPWM2_PWMA03			0x1DC 0x3CC 0x474 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_02_SAI1_TX_DATA01			0x1DC 0x3CC 0x5A0 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_02_FLEXCAN1_TX			0x1DC 0x3CC 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_02_GPIO3_IO02			0x1DC 0x3CC 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_02_CCM_WAIT				0x1DC 0x3CC 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_02_SAI3_TX_SYNC			0x1DC 0x3CC 0x784 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_SD_B1_03_USDHC2_DATA0			0x1E0 0x3D0 0x5E8 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_03_FLEXSPIB_DATA00			0x1E0 0x3D0 0x4B8 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_03_FLEXPWM2_PWMB03			0x1E0 0x3D0 0x484 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_03_SAI1_MCLK				0x1E0 0x3D0 0x58C 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_03_FLEXCAN1_RX			0x1E0 0x3D0 0x44C 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_03_GPIO3_IO03			0x1E0 0x3D0 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_03_CCM_PMIC_READY			0x1E0 0x3D0 0x3FC 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_03_SAI3_TX_BCLK			0x1E0 0x3D0 0x780 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_SD_B1_04_USDHC2_CLK			0x1E4 0x3D4 0x5DC 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_04_FLEXSPIB_SCLK			0x1E4 0x3D4 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_04_LPI2C1_SCL			0x1E4 0x3D4 0x4CC 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_04_SAI1_RX_SYNC			0x1E4 0x3D4 0x5A4 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_04_FLEXSPIA_SS1_B			0x1E4 0x3D4 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_04_GPIO3_IO04			0x1E4 0x3D4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_04_CCM_STOP				0x1E4 0x3D4 0x000 0x6 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_04_SAI3_MCLK				0x1E4 0x3D4 0x770 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_SD_B1_05_USDHC2_CMD			0x1E8 0x3D8 0x5E4 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_05_FLEXSPIA_DQS			0x1E8 0x3D8 0x4A4 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_05_LPI2C1_SDA			0x1E8 0x3D8 0x4D0 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_05_SAI1_RX_BCLK			0x1E8 0x3D8 0x590 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_05_FLEXSPIB_SS0_B			0x1E8 0x3D8 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_05_GPIO3_IO05			0x1E8 0x3D8 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_05_SAI3_RX_SYNC			0x1E8 0x3D8 0x77C 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_SD_B1_06_USDHC2_RESET_B			0x1EC 0x3DC 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B			0x1EC 0x3DC 0x000 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_06_LPUART7_CTS_B			0x1EC 0x3DC 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_06_SAI1_RX_DATA00			0x1EC 0x3DC 0x594 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_06_LPSPI2_PCS0			0x1EC 0x3DC 0x4FC 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_06_GPIO3_IO06			0x1EC 0x3DC 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_06_SAI3_RX_BCLK			0x1EC 0x3DC 0x774 0x8 0x1

#define MXRT1060_IOMUXC_GPIO_SD_B1_07_SEMC_CSX01			0x1F0 0x3E0 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK			0x1F0 0x3E0 0x4C8 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_07_LPUART7_RTS_B			0x1F0 0x3E0 0x000 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_07_SAI1_TX_DATA00			0x1F0 0x3E0 0x000 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_07_LPSPI2_SCK			0x1F0 0x3E0 0x500 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_07_GPIO3_IO07			0x1F0 0x3E0 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B1_08_USDHC2_DATA4			0x1F4 0x3E4 0x5F8 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00			0x1F4 0x3E4 0x4A8 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_08_LPUART7_TX			0x1F4 0x3E4 0x55C 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_08_SAI1_TX_BCLK			0x1F4 0x3E4 0x5A8 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_08_LPSPI2_SD0			0x1F4 0x3E4 0x508 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_08_GPIO3_IO08			0x1F4 0x3E4 0x000 0x5 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_08_SEMC_CSX02			0x1F4 0x3E4 0x000 0x6 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B1_09_USDHC2_DATA5			0x1F8 0x3E8 0x5FC 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01			0x1F8 0x3E8 0x4AC 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_09_LPUART7_RX			0x1F8 0x3E8 0x558 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_09_SAI1_TX_SYNC			0x1F8 0x3E8 0x5AC 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_09_LPSPI2_SDI			0x1F8 0x3E8 0x504 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_09_GPIO3_IO09			0x1F8 0x3E8 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B1_10_USDHC2_DATA6			0x1FC 0x3EC 0x600 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02			0x1FC 0x3EC 0x4B0 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_10_LPUART2_RX			0x1FC 0x3EC 0x52C 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_10_LPI2C2_SDA			0x1FC 0x3EC 0x4D8 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_10_LPSPI2_PCS2			0x1FC 0x3EC 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_10_GPIO3_IO10			0x1FC 0x3EC 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_SD_B1_11_USDHC2_DATA7			0x200 0x3F0 0x604 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03			0x200 0x3F0 0x4B4 0x1 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_11_LPUART2_TX			0x200 0x3F0 0x530 0x2 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_11_LPI2C2_SCL			0x200 0x3F0 0x4D4 0x3 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_11_LPSPI2_PCS3			0x200 0x3F0 0x000 0x4 0x0
#define MXRT1060_IOMUXC_GPIO_SD_B1_11_GPIO3_IO11			0x200 0x3F0 0x000 0x5 0x0

#define MXRT1060_IOMUXC_GPIO_SPI_B0_00					0x65C 0x6B4 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B0_01_FLEXSPI2_B_SCLK			0x660 0x6B8 0x754 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_SPI_B0_02_FLEXSPI2_A_DATA00		0x664 0x6BC 0x730 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_SPI_B0_03_FLEXSPI2_B_DATA02		0x668 0x6C0 0x748 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_SPI_B0_04_FLEXSPI2_B_DATA03		0x66C 0x6C4 0x74C 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_SPI_B0_05_FLEXSPI2_A_SS0_B			0x670 0x6C8 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B0_06_FLEXSPI2_A_DATA02		0x674 0x6CC 0x738 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_SPI_B0_07_FLEXSPI2_B_DATA01		0x678 0x6D0 0x744 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_SPI_B0_08_FLEXSPI2_A_SCLK			0x67C 0x6D4 0x750 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_SPI_B0_09_FLEXSPI2_A_DQS			0x680 0x6D8 0x72C 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_SPI_B0_10_FLEXSPI2_A_DATA03		0x684 0x6DC 0x73C 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_SPI_B0_11_FLEXSPI2_B_DATA00		0x688 0x6E0 0x740 0x0 0x1
#define MXRT1060_IOMUXC_GPIO_SPI_B0_12_FLEXSPI2_A_DATA01		0x68C 0x6E4 0x734 0x0 0x2
#define MXRT1060_IOMUXC_GPIO_SPI_B0_13					0x690 0x6E8 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B1_00_FLEXSPI2_A_DQS			0x694 0x6EC 0x72C 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B1_01_FLEXSPI2_A_DATA03		0x698 0x6F0 0x73C 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B1_02_FLEXSPI2_A_DATA02		0x69C 0x6F4 0x738 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B1_03_FLEXSPI2_A_DATA01		0x6A0 0x6F8 0x734 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B1_04_FLEXSPI2_A_DATA00		0x6A4 0x6FC 0x730 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B1_05_FLEXSPI2_A_SCLK			0x6A8 0x700 0x750 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B1_06_FLEXSPI2_A_SS0_B			0x6AC 0x704 0x000 0x0 0x0
#define MXRT1060_IOMUXC_GPIO_SPI_B1_07					0x6B0 0x708 0x000 0x0 0x0

#endif /* _DT_BINDINGS_PINCTRL_IMXRT1060_PINFUNC_H */
